SELECT        Товары.Наименование, Заказы.[Дата поставки]
FROM            Товары INNER JOIN
                         Заказы ON Товары.Наименование = Заказы.[Наименование товара]
WHERE        (Заказы.[Дата поставки] > CONVERT(DATETIME, '2022-02-01 00:00:00', 102))
SELECT        Товары.Наименование, Заказы.[Наименование товара], Заказы.[Цена продажи]
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.[Наименование фирмы] = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.[Наименование товара] = Товары.Наименование
WHERE        (Заказы.[Цена продажи] < 500 AND Заказы.[Цена продажи] > 100)
SELECT        Заказчики.[Наименование фирмы], Товары.Наименование
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.[Наименование фирмы] = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.[Наименование товара] = Товары.Наименование
WHERE        (Товары.Наименование = N'наим1')
SELECT        Заказчики.[Наименование фирмы], Заказы.[Номер заказа], Заказы.[Дата поставки]
FROM            Заказчики INNER JOIN
                         Заказы ON Заказчики.[Наименование фирмы] = Заказы.Заказчик INNER JOIN
                         Товары ON Заказы.[Наименование товара] = Товары.Наименование
ORDER BY Заказы.[Дата поставки]