USE ЛР15;
insert into STUDENT(IDGROUP, NAME, BDAY, INFO)
	values(18, 'NAME', '01.01.1999',
	'<студент>
		<паспорт серия="АВ" номер="1234567" дата="01.01.1999" />
		<телефон>+375291234567</телефон>
		<адрес>
			<страна>Беларусь</страна>
			<город>City</город>
			<улица>Street</улица>
			<дом>House</дом>
			<квартира>Kv</квартира>
		</адрес>
	</студент>');
select * from STUDENT where NAME = 'Name';
update STUDENT set INFO = '<студент>
		<паспорт серия="АВ" номер="1234567" дата="01.01.1999" />
		<телефон>+375291234567</телефон>
		<адрес>
			<страна>Беларусь</страна>
			<город>City</город>
			<улица>Street</улица>
			<дом>House</дом>
			<квартира>Kv</квартира>
		</адрес>
	</студент>' where NAME='Name.'
select NAME[ФИО], INFO.value('(студент/паспорт/@серия)[1]', 'char(2)')[Серия паспорта],
	INFO.value('(студент/паспорт/@номер)[1]', 'varchar(20)')[Номер паспорта],
	INFO.query('/студент/адрес')[Адрес]
		from  STUDENT
			where NAME = 'Name';